angular.module('drugs.controllers', ['drugs.services','ngCordova'])

.controller('AppCtrl', function() {

})

.controller('FavoritesCtrl', function($scope) {
  $scope.favorites = [
    { title: 'Анальгин', id: 1 },
    { title: 'Тироксин', id: 2 },
    { title: 'Но-шпа', id: 3 },
    { title: 'Корвалол', id: 4 }
  ];
})

.controller('FavoritCtrl', function($scope, $stateParams) {
})

.controller('SearchCtrl', function($scope,$state,$cordovaToast,SearchDataService,DetailsService,friendService,$timeout){
  $scope.data={
    results:"",
    search:"",
    queryType:true
  };
  $scope.search=function(){
    if(typeof $scope.data.queryType !== 'undefined' && typeof $scope.data.search !='undefined'){
        loadRemoteData();
    }
  }


 var lastRequest;

 function loadRemoteData() {

     friendService.cancel( lastRequest );

     lastRequest = friendService.getFriends($scope.data.search,$scope.data.queryType?'name':'ats');
     lastRequest.then(
         function( list ) {
           $timeout(function(){
              $scope.data.results = list;
           },100);
         }
     );
     return( lastRequest );
 }


  $scope.typeChange=function(){
    $cordovaToast.showShortCenter( $scope.data.queryType ?
      'Поиск по названию' : 'Поиск по активному веществу')
      .then(function(){
      $scope.search();
    });
  }

  $scope.details=function(item){
    //goto details
    console.log(item);
    DetailsService.save(item);
    $state.go('app.details');
  };

})

.controller('AnalogCtrl', function($scope,analog,SearchDataService) {
  SearchDataService.searchAnalogs(analog).then(function(result){
    $scope.data=result;
    console.log($scope.data);
  });
})

.controller('DetailsCtrl', function($scope,details) {
  $scope.data=details;
})

.controller("MapCtrl", function($scope) {

  var arrmarr=[['47.822681, 35.161533', 'Героев Сталинграда, 30','061-787-66-18','07:30 - 22:00'],
  ['47.810751, 35.184199', 'пр.Ленина 42','764-73-25','07:00-20:00'],
  ['47.858746, 35.10424', 'пр.Металлургов 16','707-25-36','08:00 - 21:00'],
  ['47.887970, 35.066175', 'Ладожская 19','283-52-77','8:00 - 20:00'],
  ['47.8853, 35.0733', 'Ладожская, 14','212-55-28','08:00 - 21:00'],
  ['47.824452, 35.161399', 'Героев Сталинграда, 13','2203346','круглосуточно'],
  ['47.8225, 35.1612', 'Запорожская,6','63-19-93','8:00 - 21:00'],
  ['47.8256, 35.165', 'Ленина 87','228-00-25','08.00-22.00'],
  ['47.817442, 35.175200', 'пр. Ленина, 51','289-70-64','круглосуточно'],
  ['47.821420, 35.169829', 'пр.Ленина/Грязнова 81/49','222-08-45','07.00-21.00'],
  ['47.8905, 35.1511', 'Радиаторная, 36','222-28-09','8:00 - 20:00'],
  ['47.895367, 35.161310', 'ул.Перспективная, 6','236-64-00','07:00 - 21:00'],
  ['47.787743, 35.221137', 'Космическая 112','222-29-50','8:00 - 20:00'],
  ['47.7867, 35.2281', 'Космическая 120','96-40-95','08:00 - 20:00'],
  ['47.7902, 35.2135', 'Космическая, 96','7692623','08:00 - 21:00'],
  ['47.795290, 35.185378', 'Ленина 3','220-29-38','круглосуточно'],
  ['47.78, 35.1845', 'Новокузнецкая 16а','2149962','08:00 - 20:00'],
  ['47.779901, 35.182602', 'Новокузнецкая 27','279-37-57','08:00 - 22:00'],
  ['47.7798, 35.2153', 'Чумаченко,34','769-27-99','08:00 - 22:00'],
  ['47.8588, 35.1045', 'Металлургов,16','236-99-64','07:00 - 22:00'],
  ['47.882610, 35.018260', 'Рустави,2','275-90-43','8:00 - 20:00'],
  ['47.877531, 35.056611', 'Счастливая, 3 ','283-29-54','круглосуточно'],
  ['47.875632, 35.053602', 'Счастливая, 9','224-73-60','08:00-20:00'],
  ['47.8737, 35.0496', 'Счастливая,15','283-56-37','08.00-20.00'],
  ['47.861627, 35.107600', 'пр.Металлургов, 2е ','707-26-24','07:00 - 21:00'],
  ['47.849903, 35.125309', '40 лет Сов. Украины,68','212-65-48','8:00 - 20:00'],
  ['47.8435, 35.1302', 'Ленина 149','233-21-65','круглосуточно'],
  ['47.8461, 35.1253', 'Ленина 153','236-12-90','08:00 - 21:00'],
  ['47.8325, 35.144732', 'Патриотическая, 86/Победы, 121','279-44-19','07:00 - 21:00'],
  ['47.836272, 35.134409', 'Патриотическая,68','222-52-99','8:00 - 20:00'],
  ['47.8469, 35.1068', 'Победы,30','220-02-66','8:00 - 20:00'],
  ['47.8419, 35.1422', 'профсоюзов','224-68-08','08.00-20.00'],
  ['47.8817, 35.0157', 'Звенигородская, 1','226 50 50','08:00 - 20:00'],
  ['47.823972, 35.041361', 'Гудыменко, 32','707-25-23','круглосуточно'],
  ['47.8227, 35.0423', 'Гудыменко,15','273-53-35','8:00 - 20:00'],
  ['47.821521, 35.030576', 'Новгородская,30','701-20-10','8:00 - 20:00'],
  ['47.831391, 35.016493', 'Хорт. шоссе, 30в','42-03-70','08:00 - 20:00'],
  ['47.8277, 35.0191', 'Хортицкое шоссе, 18 ','708-25-23','8:00 - 20:00'],
  ['47.822950, 35.026734', 'Хортицкое шоссе, 4 (АТБ)','278-92-29','08:00 - 20:00'],
  ['47.811006, 35.047987', 'Энтузиастов,2','277-00-09','08.00-20.00'],
  ['47.8105, 35.0483', 'Энтузиастов,3','286-90-90','8:00 - 21:00'],
  ['47.832, 35.2006', '8 Марта,56а','701-31-13','круглосуточно'],
  ['47.834290, 35.200509', '8 марта 58','701-31-60','08:00 - 20:00'],
  ['47.8149, 35.1956', '8 марта, 28','2222507','08:00 - 20:00'],
  ['47.850792, 35.234370', 'Авраменко 13','222-54-66','круглосуточно'],
  ['47.837985, 35.213788', 'Чаривная 121','061-707-26-21','08.00-20.00'],
  ['47.838406, 35.218016', 'Чаривная, 129 б ','707-26-28','круглосуточно'],
  ['47.8386, 35.2188', 'Чаривная,129б','68-46-00','08.00-21.00'],
  ['47.837269, 35.213186', 'Чаривная,46б','717-16-70','8:00 - 20:00']];
$scope.markers=[];
for(i=0;i<arrmarr.length;i++){
  $scope.markers.push({
    lat: parseFloat(arrmarr[i][0].split(',')[0]),
    lng: parseFloat(arrmarr[i][0].split(',')[1]),
    message: 'тел:'+arrmarr[i][2] + ' время: ' +arrmarr[i][3],
    focus: false,
    draggable: false
  })
}

  angular.extend($scope, {
      center: {
          lat: 47.822681,
          lng: 35.161533,
          zoom: 14
      },
      defaults: {
          scrollWheelZoom: false,
          tileLayer: 'http://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png'
      }
  });
});
